#/usr/bin/python3
#coding:utf-8

#*******************************************************************************
# 既然变量可以指向函数，函数的参数能接收变量，那么一个函数就可以接收另一个函数作为参数，这种函
# 数就称之为高阶函数。
# 一个最简单的高阶函数：
#*******************************************************************************

def add(x,y,f):
    return f(x)+f(y)

x = int(input("x:"))
y = int(input("y:"))
print(add(x,y,abs))

#*******************************************************************************
# 当我们调用add(-5, 6, abs)时，参数x，y和f分别接收-5，6和abs，根据函数定义，我们可以推计
# 算过程为：
# x = -5
# y = 6
# f = abs
# f(x) + f(y) ==> abs(-5) + abs(6) ==> 11
# return 11
# 把函数作为参数传入，这样的函数称为高阶函数，函数式编程就是指这种高度抽象的编程范式。
#*******************************************************************************
