#/usr/bin/python3
#coding:utf-8

#*******************************************************************************
# 有一个函数f(x)=x2，要把这个函数作用在一个list [1, 2, 3, 4, 5, 6, 7, 8, 9]上，就可以  # 用map()实现如下：
#*******************************************************************************

def f(x):
    return x*x

r = map(f,[x for x in range(10)])
print(r)

#*******************************************************************************# map()传入的第一个参数是f，即函数对象本身。由于结果r是一个Iterator，Iterator是惰性序列， # 因此通过list()函数让它把整个序列都计算出来并返回一个list。
#*******************************************************************************

#*******************************************************************************
# map()作为高阶函数，事实上它把运算规则抽象了，因此，我们不但可以计算简单的f(x)=x2，还可计  # 算任意复杂的函数，比如，把这个list所有数字转为字符串：
#*******************************************************************************

r1 = map(str,[x for x in range(10)])
print(r1)

r2 = map(int,r1)
print(r2)
