#/usr/bin/python3
# coding:utf-8

#*************************************************************************
# sorted()是一个高阶函数。用sorted()排序的关键在于实现一个映射函数。
# 假设我们用一组tuple表示学生名字和成绩：
# L = [('Bob', 75), ('Adam', 92), ('Bart', 66), ('Lisa', 88)]
# 用sorted()对上述列表分别按名字排序：
#*************************************************************************

L = [('Bob', 75), ('Adam', 92), ('Bart', 66), ('Lisa', 88)]


def by_names(t):
    return t[0].lower()

L2 = sorted(L, key=by_names)

print(L2)

#*************************************************************************
# 再按成绩从高到低排序：
#*************************************************************************


def by_score(t):
    return t[1]

L3 = sorted(L, key=by_score, reverse=True)

print(L3)
