#/usr/bin/python3
# coding:utf-8

#******************************************************************************
# StringIO
# 很多时候，数据读写不一定是文件，也可以在内存中读写。
# StringIO顾名思义就是在内存中读写str。
# 要读取StringIO，可以用一个str初始化StringIO，然后，像读文件一样读取：
#******************************************************************************
from io import StringIO
f = StringIO('Hello!\nHi!\nGoodBye!')
while True:
    s = f.readline()
    if s == '':
        break
    print(s.strip())

#*******************************************************************************
# StringIO操作的只能是str
#*******************************************************************************
